---
kind: other
id: Properties.T:Autodesk.Revit.DB.ElementId
source: html/6551f79a-beaf-ebd2-ea64-97d225026d31.htm
---
# ElementId Properties

Provides the value of the element id as a 32-bit integer.